{"backend": "tensorflow", "config": {"layers": [{"config": {"sparse": false, "batch_input_shape": [null, 10], "dtype": "float32", "name": "input_3"}, "class_name": "InputLayer", "name": "input_3", "inbound_nodes": []}, {"config": {"bias_constraint": null, "units": 64, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_9", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_9", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["dense_9", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "units": 64, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_10", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_10", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["dense_10", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "units": 64, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense_11", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_11", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"config": {"beta_regularizer": null, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "trainable": true, "momentum": 0.99}, "class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["dense_11", 0, 0, {}]]]}, {"config": {"bias_constraint": null, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "activation": "sigmoid", "name": "dense_12", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "mode": "fan_in", "scale": 2.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_12", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "name": "model_3", "output_layers": [["dense_12", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.8"}